Exploring pandas library

In [1]:
#importing the libraries

import pandas as pd
import numpy as np

1 - Part1

In [2]:
data = pd.read_excel("online_retail.xlsx")

In [3]:
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [4]:
print("Shape of the data : ", data.shape)

Shape of the data :  (541909, 8)

In [5]:
# Create subset of data frame containing rows where value is
# 536544 in voice field and containing first 4 columns only.

data.loc[data.InvoiceNo == 536544, ['StockCode', 'Description', 'Quantity']]

     StockCode                      Description  Quantity
1443     21773  DECORATIVE ROSE BATHROOM BOTTLE         1
1444     21774  DECORATIVE CATS BATHROOM BOTTLE         2
1445     21786               POLKADOT RAIN HAT          4
1446     21787            RAIN PONCHO RETROSPOT         2
1447     21790               VINTAGE SNAP CARDS         9
...        ...                              ...       ...
1965     21721        CANDY SHOP  STICKER SHEET         1
1966     21722      SWEET PUDDING STICKER SHEET         1
1967     21731    RED TOADSTOOL LED NIGHT LIGHT         5
1968     21742      LARGE ROUND WICKER PLATTER          1
1969     21758             VINTAGE SHELLS PRINT         1

[527 rows x 3 columns]

Read from sheet, only stock code and price
Statistical analysis: Apply simple statistics on the “price” column. Like, find
min, max, median, mean, count, sum, standard deviation, and variance

In [6]:
df = pd.read_excel("online_retail.xlsx",usecols = ["StockCode","UnitPrice"])

In [7]:
df.head()

  StockCode  UnitPrice
0    85123A       2.55
1     71053       3.39
2    84406B       2.75
3    84029G       3.39
4    84029E       3.39

In [8]:
print("min:",data.UnitPrice.min())
print("max:",data.UnitPrice.max())
print("count:",data.UnitPrice.count())
print("sum:",data.UnitPrice.sum())
print("standard deviation:",data.UnitPrice.std())
print("variance:",data.var())

min: -11062.06
max: 38970.0
count: 541909
sum: 2498803.974
standard deviation: 96.75985306119716
variance: Quantity      4.755939e+04
UnitPrice     9.362469e+03
CustomerID    2.936426e+06
dtype: float64

In [9]:
df_skip = pd.read_excel('online_retail.xlsx', skiprows = 100)
df_skip.head()

,536378,84991,60 TEATIME FAIRY CAKE CASES,24,2010-12-01 09:37:00,0.55,14688,United Kingdom
0,536378,84519A,TOMATO CHARLIE+LOLA COASTER SET,6,2010-12-01 09:37:00,2.95,14688.0,United Kingdom
1,536378,85183B,CHARLIE & LOLA WASTEPAPER BIN FLORA,48,2010-12-01 09:37:00,1.25,14688.0,United Kingdom
2,536378,85071B,RED CHARLIE+LOLA PERSONAL DOORSIGN,96,2010-12-01 09:37:00,0.38,14688.0,United Kingdom
3,536378,21931,JUMBO STORAGE BAG SUKI,10,2010-12-01 09:37:00,1.95,14688.0,United Kingdom
4,536378,21929,JUMBO BAG PINK VINTAGE PAISLEY,10,2010-12-01 09:37:00,1.95,14688.0,United Kingdom

In [10]:
df_skip.columns

Index([                       536378,                         84991,
       '60 TEATIME FAIRY CAKE CASES',                            24,
                 2010-12-01 09:37:00,                          0.55,
                               14688,              'United Kingdom'],
      dtype='object')

In [11]:
# Sort the records by the “InvoiceDate” column
data.sort_values("InvoiceDate", axis = 0, ascending = True,
                 inplace = True)
data.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 08:26:00,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 08:26:00,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 08:26:00,3.39,17850.0,United Kingdom

In [12]:
# Find details where " Description " starts with letter "D”, You can use Map Function

condition = data.Description.str[0] == 'D'
D = data[condition]
D.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
20,536367,48187,DOORMAT NEW ENGLAND,4,2010-12-01 08:34:00,7.95,13047.0,United Kingdom
140,536381,21523,DOORMAT FANCY FONT HOME SWEET HOME,10,2010-12-01 09:41:00,6.75,15311.0,United Kingdom
141,C536379,D,Discount,-1,2010-12-01 09:41:00,27.50,14527.0,United Kingdom
185,536388,21523,DOORMAT FANCY FONT HOME SWEET HOME,2,2010-12-01 09:59:00,7.95,16250.0,United Kingdom
228,536390,22654,DELUXE SEWING KIT,40,2010-12-01 10:19:00,4.95,17511.0,United Kingdom

2. Creating a dataframe (pandas): 

Creating a student database with 5 entries

In [13]:
# Create dataframe from  lists of lists.
   
data = [['vineeth', 18, 10], ['Kim', 19, 20], ['Ken', 20 , 30]]  
   
df = pd.DataFrame(data, columns = ['Name', 'Age' , 'Marks'])  
  
print(df)

      Name  Age  Marks
0  vineeth   18     10
1      Kim   19     20
2      Ken   20     30

In [14]:
# Create dataframe from  dicts of ndarray

data = { "Name" : ["Vineeth","Kim","Ken"],
         "Age" : [18,19,20],
        "Marks" : [10,20,30]
       }

df = pd.DataFrame(data)  
  
print(df)

      Name  Age  Marks
0  Vineeth   18     10
1      Kim   19     20
2      Ken   20     30

In [15]:
# Create dataframe from list of dicts

data = [{'Name': 'Vineeth', 'Age': 18, 'Marks': 10}, 
        {'Name': 'Kim', 'Age': 19, 'Marks': 20},
        {'Name': 'Ken', 'Age': 20, 'Marks': 30}
       ]  
df = pd.DataFrame(data)
print(df)

      Name  Age  Marks
0  Vineeth   18     10
1      Kim   19     20
2      Ken   20     30

In [16]:
# Create dataframe from dict of series

# series works as a index : value format.
data = {'Vineeth': 18 , 
        'Kim' : 19 ,
        'Ken' : 20 }
        
ss = pd.Series(data)
df = pd.DataFrame(ss, columns = ['Age'])
df

         Age
Vineeth   18
Kim       19
Ken       20

Create an empty DataFrame with columns name only then appending rows one by
one to it using append() method. Empty data frame should be having 3 columns
“student name”,”date of birth”, “marks in english”. Append one by one 5 random
rows to this dataframe.

In [17]:
df = pd.DataFrame(columns = ['Name', 'Date of Birth', "Marks in English"], dtype = 'object')
df

Empty DataFrame
Columns: [Name, Date of Birth, Marks in English]
Index: []

In [18]:
df.columns

Index(['Name', 'Date of Birth', 'Marks in English'], dtype='object')

In [19]:
row = pd.Series(['Vineeth', 18, 100], index = df.columns)
df = df.append(row, ignore_index = True)
df

      Name Date of Birth Marks in English
0  Vineeth            18              100

In [20]:
row = pd.Series(['Kim', 19, 90], index = df.columns)
df = df.append(row, ignore_index = True)
df

      Name Date of Birth Marks in English
0  Vineeth            18              100
1      Kim            19               90

In [21]:
names = ['ken', 'ben', 'ram']
dob = [20, 21, 22]
marks = [80, 70, 60]

for i in range(len(names)):
    row = pd.Series([names[i], dob[i], marks[i]], index = df.columns)
    df = df.append(row, ignore_index = True)
df

      Name Date of Birth Marks in English
0  Vineeth            18              100
1      Kim            19               90
2      ken            20               80
3      ben            21               70
4      ram            22               60

3 - Working with Series

In [22]:
import random

Set1 = random.sample(range(1, 1000), 100)
Set2 = random.sample(range(1, 1000), 100)
  
ser1 = pd.Series(Set1) 
ser2 = pd.Series(Set2)
ser3 = ser1.add(ser2, fill_value=0)
ser4 = ser1.sub(ser2, fill_value=0)
ser5 = ser1.mul(ser2, fill_value=0)
ser6 = ser1.div(ser2, fill_value=0)
#print(ser6)
frame = { 'Ser1': ser1, 'Ser2': ser2,'add': ser3, 'Sub': ser4,'mul': ser5, 'div': ser6 } 
  
result = pd.DataFrame(frame) 
  
print(result)

    Ser1  Ser2   add  Sub     mul         div
0    124   602   726 -478   74648    0.205980
1     16   836   852 -820   13376    0.019139
2     83   332   415 -249   27556    0.250000
3    214   379   593 -165   81106    0.564644
4    334     3   337  331    1002  111.333333
..   ...   ...   ...  ...     ...         ...
95   981    82  1063  899   80442   11.963415
96   399   894  1293 -495  356706    0.446309
97   810   743  1553   67  601830    1.090175
98   419   837  1256 -418  350703    0.500597
99   626   843  1469 -217  527718    0.742586

[100 rows x 6 columns]